admin/app/Controllers/Product.php

SELECT *
FROM `product`
---
    public function index()
    {
        $data['product'] = $this->product->findAll();